# language: ru
@VkProfileScenarioAPI

Функционал: Редактирование профиля VK
  - Получить всю информацию о текущем профиле
  - Заполнить недостающую информацию
  - Сменить фото профиля на любую другую

  Сценарий: Получение информации о профиле
    И сохранить в переменные цитруса по ключу "Токен" значение "токен"
    И сохранить в переменные цитруса по ключу "Версия" значение "5.131"
    И сохранить в переменные цитруса по ключу "Path" значение "photos.getOwnerPhotoUploadServer"
    И отправить в сервис vk запрос Get "${Path}?access_token=${Токен}&v=${Версия}" и извлечь данные по пути "$.*" и записать их в переменную response
    И извлечь данные из переменной response
      | upload_url | $.upload_url |





