# language: ru
@VkProfileScenarioPhotoChange

Функционал: Редактирование профиля VK
  - Сменить фото профиля на любую другую

  Сценарий: Изменение фотографии в профиле
    Дано открываем тестируемое приложение
    И перейти к странице 'Страница логина Vk'
    И на текущей странице перейти к блоку "Блок логина"
    Тогда проверить что отображается блок

    И в поле ввода "Поле ввода логина" ввести "логин"
    И в поле ввода "Поле ввода пароля" ввести "пароль"
    Затем нажать на кнопку с текстом 'Войти'

    И перейти к странице 'Страница новостей'
    И на текущей странице перейти к блоку "Блок навигации"
    Тогда проверить что отображается блок
    Тогда проверить что адрес ссылки  = 'https://vk.com/id690043267'
    И нажать на "кнопку"
    Затем перейти к странице 'Главная страница Vk'

    И на текущей странице перейти к блоку "Элемент выбора фотографии"
    Затем переместить мышь на фото
    И нажать кнопку выбора фотографии
    Затем перейти к странице 'Главная страница Vk'
    И на текущей странице перейти к блоку "Блок загрузки фотографии"
    Тогда проверить что отображается блок
    И выбрать файл по пути "g:\\antara\\automation-framework-box\\src\\test\\resources\\img.png"
    Затем перейти к странице 'Главная страница Vk'
    И на текущей странице перейти к блоку "Блок сохранения фотографии"
    Тогда проверить что отображается блок
    И нажать на кнопку с текстом 'Сохранить и продолжить'
    Затем перейти к странице 'Главная страница Vk'
    И на текущей странице перейти к блоку "Блок выбора миниатюры"
    Тогда проверить что отображается блок
    И нажать на кнопку с текстом 'Сохранить изменения'
    Затем перейти к странице 'Главная страница Vk'
    И на текущей странице перейти к блоку "Блок публикации фотографии"
    Тогда проверить что отображается блок
    И деактивировать чекбокс с именем 'Чекбокс опубликовать запись'
    И деактивировать чекбокс с именем 'Чекбокс опубликовать историю'
    И нажать на кнопку с текстом 'Продолжить'











