# language: ru
@VkProfileScenario

Функционал: Редактирование профиля VK
  - Получить всю информацию о текущем профиле
  - Заполнить недостающую информацию
  - Сменить фото профиля на любую другую

  Сценарий: Получение информации о профиле
    Дано открываем тестируемое приложение
    И перейти к странице 'Страница логина Vk'
    Тогда проверить видимость страницы VK

    И на текущей странице перейти к блоку 'Блок список' - "3"
    И проверить что отображется блок
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать элемент по значению "1980"
    И на текущей странице перейти к блоку 'Блок список' - "2"
    И проверить что отображется блок
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать элемент по значению "4"
    И на текущей странице перейти к блоку 'Блок список' - "1"
    И проверить что отображется блок
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать элемент по значению "11"

    И на текущей странице перейти к блоку "Блок логина"
    И проверить что отображется блок
    И в поле ввода "Поле ввода логина" ввести "логин"
    И в поле ввода "Поле ввода пароля" ввести "пароль"
    И нажать на кнопку с текстом 'Войти'
    И перейти к странице 'Страница новостей'
    И на текущей странице перейти к блоку "Блок навигации"
    И проверить что отображется блок
    Тогда проверить что адрес ссылки  = 'https://vk.com/id690043267'
    И нажать на "кнопку"
    И перейти к странице 'Главная страница Vk'
    И на текущей странице перейти к блоку "Блок перехода к профилю"
    И проверить что отображется блок
    Тогда проверить что адрес ссылки  = 'https://vk.com/edit'
    И нажать на "кнопку"

    И перейти к странице 'Страница редактирования профиля'
    И на текущей странице перейти к блоку 'Блок редактировани профиля'
    Тогда проверить что адрес ссылки  = 'https://id.vk.com/account/'
    И на текущей странице перейти к блоку 'Блок список' - "4"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение если поле пустое
    И на текущей странице перейти к блоку 'Блок список' - "8"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение если поле пустое
    И на текущей странице перейти к блоку 'Блок список' - "7"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение если поле пустое
    И на текущей странице перейти к блоку 'Блок список' - "6"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение если поле пустое
    И на текущей странице перейти к блоку 'Блок список' - "9"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение если поле пустое
    И перейти к странице 'Страница редактирования профиля'
    И на текущей странице перейти к блоку 'Блок редактировани профиля'
    И проверить что отображется блок
    И очистить поле "поле ввода"
    И в поле ввода "Поле ввода города" ввести случайный город
    И нажать на "кнопку"

