# language: ru
@VkProfileScenario

Функционал: Редактирование профиля VK
  - Получить всю информацию о текущем профиле
  - Заполнить недостающую информацию
  - Сменить фото профиля на любую другую

  Сценарий: Получение информации о профиле
    Дано открываем тестируемое приложение
    И перейти к странице 'Страница логина Vk'
    Тогда проверить видимость страницы VK

    И на текущей странице перейти к блоку 'Блок список' - "3"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение
    И на текущей странице перейти к блоку 'Блок список' - "2"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение
    И на текущей странице перейти к блоку 'Блок список' - "1"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение

    И на текущей странице перейти к блоку "Блок логина"
    И проверить что блок существует
    И в поле ввода "Поле ввода логина" ввести "логин"
    И в поле ввода "Поле ввода пароля" ввести "пароль"
    И нажать на кнопку с текстом 'Войти'
    И перейти к странице 'Страница новостей'
    И на текущей странице перейти к блоку "Блок навигации"
    Тогда проверить что адрес ссылки  = 'https://vk.com/audio'
    И нажать на "кнопку"
    И перейти к странице 'Главная страница Vk'
    И на текущей странице перейти к блоку "Блок перехода к профилю"
    Тогда проверить что адрес ссылки  = 'https://vk.com/edit'
    И нажать на "кнопку"

    И перейти к странице 'Страница редактирования профиля'

    И на текущей странице перейти к блоку 'Блок редактировани профиля'
    Тогда проверить что адрес ссылки  = 'https://id.vk.com/account/'

    И на текущей странице перейти к блоку 'Блок список' - "4"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение

    И на текущей странице перейти к блоку 'Блок список' - "8"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение

    И на текущей странице перейти к блоку 'Блок список' - "7"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение

    И на текущей странице перейти к блоку 'Блок список' - "6"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение

    И на текущей странице перейти к блоку 'Блок список' - "10"
    И нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение

