# language: ru
@VkProfileScenario

Функционал: Редактирование профиля VK
  - Получить всю информацию о текущем профиле
  - Заполнить недостающую информацию
  - Сменить фото профиля на любую другую

  Сценарий: Получение информации о профиле
    Дано открываем тестируемое приложение
    И перейти к странице 'Страница логина Vk'
    Затем на текущей странице перейти к блоку "Блок логина"
    И проверить что блок существует
    И выполнить действие "ввести_логин", c аргументами ""
    И выполнить действие "ввести_пароль", c аргументами ""
    И нажать на "кнопку"
    И перейти к странице 'Страница новостей'
    И на текущей странице перейти к блоку "Блок навигации"
    Тогда проверить что адрес ссылки  = 'https://vk.com/audio'
    И нажать на "кнопку"
    И перейти к странице 'Главная страница Vk'
    И на текущей странице перейти к блоку "Блок перехода к профилю"
    Тогда проверить что адрес ссылки  = 'https://vk.com/edit'
    И нажать на "кнопку"
    И перейти к странице 'Страница редактирования профиля'
    И на текущей странице перейти к блоку "Блок редактировани профиля"
    Тогда проверить что адрес ссылки  = 'https://id.vk.com/account/'
    И в выпадающем списке  выбрать значение "Женат"
    И нажать на "кнопку"
