# language: ru
@VkProfileScenarioFieldsEdit

Функционал: Редактирование профиля VK
  - Получить всю информацию о текущем профиле
  - Заполнить недостающую информацию

  Сценарий: Получение информации о профиле
    Дано открываем тестируемое приложение
    И перейти к странице 'Страница логина Vk'
    И на текущей странице перейти к блоку "Блок логина"
    Тогда проверить что отображается блок

    И в поле ввода "Поле ввода логина" ввести "логин"
    И в поле ввода "Поле ввода пароля" ввести "пароль"
    Затем нажать на кнопку с текстом 'Войти'

    И перейти к странице 'Страница новостей'
    И на текущей странице перейти к блоку "Блок навигации"
    Тогда проверить что отображается блок
    Тогда проверить что адрес ссылки  = 'https://vk.com/id690043267'
    И нажать на "кнопку"
    Затем перейти к странице 'Главная страница Vk'

    И на текущей странице перейти к блоку "Блок перехода к профилю"
    Тогда проверить что отображается блок
    Тогда проверить что адрес ссылки  = 'https://vk.com/edit'
    И нажать на "кнопку"

    И перейти к странице 'Страница редактирования профиля'
    И на текущей странице перейти к блоку 'Блок редактирования профиля'
    Тогда проверить что адрес ссылки  = 'https://id.vk.com/account/'
    И на текущей странице перейти к блоку 'Блок список' - "4"
    Затем нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение если поле пустое
    И на текущей странице перейти к блоку 'Блок список' - "8"
    Затем нажать на "выпадающий список"
    И в выпадающем списке выбрать элемент по значению "1"
    И на текущей странице перейти к блоку 'Блок список' - "7"
    Затем нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение если поле пустое
    И на текущей странице перейти к блоку 'Блок список' - "6"
    Затем нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение если поле пустое
    И на текущей странице перейти к блоку 'Блок список' - "9"
    Затем нажать на "выпадающий список"
    И в выпадающем списке выбрать случайное значение если поле пустое
    Затем перейти к странице 'Страница редактирования профиля'
    И на текущей странице перейти к блоку 'Блок редактирования профиля'
    Тогда проверить что отображается блок
    И очистить поле "поле ввода"
    Затем в поле ввода "Поле ввода города" ввести случайный город
    И нажать на "кнопку"






